EDT/MPCurier/src/Catalogs/Рейсы/Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Рейсы</name>
  <attributes>
    <name>НомерРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.Экспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыданТерминалAssist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспечатанМЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФинальнойТочкиМаршрута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресФинальнойТочкиМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаФинальнойТочкиМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаФинальнойТочкиМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизведенаЯндексМаршрутизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/MPCurier/src/CommonModules/МаршрутизацияСервер/Module.bsl
#Область ПрограммныйИнтерфейс
// Получить тип адреса финальной точки маршрута рейса.
// 
// Параметры:
//  ВыбранныйРейс - СправочникСсылка.Рейсы - Выбранный рейс
// 
// Возвращаемое значение:
// Число 
Функция ПолучитьТипАдресаФинальнойТочкиМаршрутаРейса(Рейс) Экспорт
	Возврат Рейс.ТипФинальнойТочкиМаршрута;
КонецФункции

// Получить данные рейса.
// 
// Параметры:
//  Рейс - СправочникСсылка.Рейсы - Рейс
// 
// Возвращаемое значение:
//  Структура - Получить данные рейса
Функция ПолучитьДанныеРейса(Рейс) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Рейсы.Ссылка КАК Ссылка,
	|	Рейсы.НомерРейса КАК НомерРейса,
	|	Рейсы.ДатаРейса КАК ДатаРейса,
	|	Рейсы.ДатаДокумента КАК ДатаДокумента,
	|	Рейсы.Транспорт КАК Транспорт,
	|	Рейсы.Водитель КАК Водитель,
	|	Рейсы.НомерПалетты КАК НомерПалетты,
	|	Рейсы.Экспедитор КАК Экспедитор,
	|	Рейсы.НомерТелефона КАК НомерТелефона,
	|	Рейсы.ВыданТерминалAssist КАК ВыданТерминалAssist,
	|	Рейсы.РаспечатанМЛ КАК РаспечатанМЛ,
	|	Рейсы.ТипФинальнойТочкиМаршрута КАК ТипФинальнойТочкиМаршрута,
	|	Рейсы.АдресФинальнойТочкиМаршрута КАК АдресФинальнойТочкиМаршрута,
	|	Рейсы.ШиротаФинальнойТочкиМаршрута КАК ШиротаФинальнойТочкиМаршрута,
	|	Рейсы.ДолготаФинальнойТочкиМаршрута КАК ДолготаФинальнойТочкиМаршрута,
	|	Рейсы.ПроизведенаЯндексМаршрутизация КАК ПроизведенаЯндексМаршрутизация
	|ИЗ
	|	Справочник.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.Ссылка = &ВыбранныйРейс";
	Запрос.УстановитьПараметр("ВыбранныйРейс", Рейс);
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураОтвета = Новый Структура;
	
	Для Каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
		СтруктураОтвета.Вставить(ТекКолонка.Имя);
	КонецЦикла;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выборка);
	КонецЕсли;	
	Возврат СтруктураОтвета;	
КонецФункции	


Функция ПолучитьШиротуИДолготуФинальнойТочкиМаршрутаРейса(ВыбранныйРейс) Экспорт
	Возврат СтрЗаменить(СокрЛП(ВыбранныйРейс.ШиротаФинальнойТочкиМаршрута) + ";" + СокрЛП(ВыбранныйРейс.ДолготаФинальнойТочкиМаршрута), ",", ".");
КонецФункции



// Зафиксировать финальную точку рейса.
// 
// Параметры:
//  СтруктураДанных - Структура - Структура данных
//  ВыбранныйРейс - СправочникСсылка.Рейсы - Выбранный рейс
Процедура ЗафиксироватьФинальнуюТочкуРейса(СтруктураДанных, ВыбранныйРейс) Экспорт
	Рейс = ВыбранныйРейс.ПолучитьОбъект();
	Рейс.ТипФинальнойТочкиМаршрута = СтруктураДанных.ТипАдреса;
	Рейс.АдресФинальнойТочкиМаршрута = СтруктураДанных.РаспознанныйАдрес;
	Рейс.ШиротаФинальнойТочкиМаршрута = СтруктураДанных.Широта;
	Рейс.ДолготаФинальнойТочкиМаршрута = СтруктураДанных.Долгота;
	Рейс.Записать();
КонецПроцедуры


Функция РаспечатанМЛ(ВыбранныйРейс) Экспорт
	Возврат ВыбранныйРейс.РаспечатанМЛ;
КонецФункции


Функция НадоЗапрашиватьЯММаршрутизациюПослеФиксацииМаршрута() Экспорт
	Возврат Константы.ЗапрашиватьЯндексМаршрутизациюПослеПостроенияМаршрута.Получить();
КонецФункции


Функция СобратьДанныеЗаказовДляМаршрутизацииЯМ(ВыбранныйРейс) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Заказ.Номер КАК Номер,
	            |	Заказ.ПорядокСортировки КАК ПорядокСортировки,
	            |	Заказ.Ссылка КАК Заказ
	            |ИЗ
	            |	Документ.Заказ КАК Заказ
	            |ГДЕ
	            |	Заказ.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.РезультатыДоставки.КДоставке)
	            |	И Заказ.Рейс = &Рейс";
	Зап.УстановитьПараметр("Рейс", ВыбранныйРейс.Ссылка);
	
	МасСтруктур = Новый Массив;
	
	Выб = Зап.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Струк = Новый Структура;
		Струк.Вставить("strizhId", Выб.Номер);
		Струк.Вставить("routeIndex", Выб.ПорядокСортировки);
		МасСтруктур.Добавить(Струк);
	КонецЦикла;	                      
	
	Возврат МасСтруктур;
КонецФункции

Функция ПолучитьДопПараметрыРейсаЯМаршрутизации(ВыбранныйРейс) Экспорт
	Струк = Новый Структура;
	Струк.Вставить("typeFinalPoint", ВыбранныйРейс.ТипФинальнойТочкиМаршрута);
	Струк.Вставить("addressFinalPoint", ВыбранныйРейс.АдресФинальнойТочкиМаршрута);
	Струк.Вставить("latFinalPoint", ВыбранныйРейс.ШиротаФинальнойТочкиМаршрута);
	Струк.Вставить("longFinalPoint", ВыбранныйРейс.ДолготаФинальнойТочкиМаршрута);
	Возврат Струк;
КонецФункции


// Найти рабочий рейс по транспорту МП.
// 
// Возвращаемое значение:
//  Структура - Найти рабочий рейс по транспорту МП:
// * Рейс - СправочникСсылка.Рейсы - 
// * НомерРейса - Строка - 
// * ДатаРейса - Дата -
Функция НайтиРабочийРейсПоТранспортуМП() Экспорт
	СтруктураОтвета = Новый Структура("Рейс, НомерРейса, ДатаРейса", Справочники.Рейсы.ПустаяСсылка(), "", Дата(1, 1, 1));
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	Рейсы.Ссылка КАК Рейс,
	|	Рейсы.НомерРейса КАК НомерРейса,
	|	Рейсы.ДатаРейса КАК ДатаРейса
	|ИЗ
	|	Справочник.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.ПометкаУдаления = ЛОЖЬ
	|	И НАЧАЛОПЕРИОДА(Рейсы.ДатаРейса, ДЕНЬ) = &ДатаРейса
	|	И Рейсы.Транспорт = &Транспорт";
	
	Если Час(ТекущаяДатаСеанса()) >= 2 Тогда
		ИскомаяДатаРейса = НачалоДня(ТекущаяДатаСеанса());
	Иначе
		ИскомаяДатаРейса = НачалоДня(ТекущаяДатаСеанса() - 86400);
	КонецЕсли;
					
	Зап.УстановитьПараметр("ДатаРейса", ИскомаяДатаРейса);
	Зап.УстановитьПараметр("Транспорт", ПараметрыСеанса.ТранспортМП);
	Выб = Зап.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выб);
	КонецеСли;
			
	Возврат СтруктураОтвета;		
КонецФункции
#КонецОбласти
